LoadTesting/Initialize_Login_1000-Staging.txt
Run #1:

Running 2m test @ https://staging-api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 4687.714ms, rate sampling interval: 16056ms
  Thread calibration: mean lat.: 4714.677ms, rate sampling interval: 16056ms
  Thread calibration: mean lat.: 4688.990ms, rate sampling interval: 15966ms
  Thread calibration: mean lat.: 4719.655ms, rate sampling interval: 16048ms
  Thread calibration: mean lat.: 4707.344ms, rate sampling interval: 15933ms
  Thread calibration: mean lat.: 4716.023ms, rate sampling interval: 16261ms
  Thread calibration: mean lat.: 4653.541ms, rate sampling interval: 15941ms
  Thread calibration: mean lat.: 4677.169ms, rate sampling interval: 16138ms
  Thread calibration: mean lat.: 4616.221ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 4650.836ms, rate sampling interval: 15958ms
  Thread calibration: mean lat.: 4637.042ms, rate sampling interval: 15966ms
  Thread calibration: mean lat.: 4634.354ms, rate sampling interval: 15933ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95m    27.81s    1.76m    57.80%
    Req/Sec     9.96      0.20    10.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95m
 75.000%    1.35m
 90.000%    1.59m
 99.000%    1.74m
 99.900%    1.76m
 99.990%    1.76m
 99.999%    1.76m
100.000%    1.76m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8871.935     0.000000            2         1.00
   18431.999     0.100000         1353         1.11
   28065.791     0.200000         2702         1.25
   37912.575     0.300000         4053         1.43
   47546.367     0.400000         5406         1.67
   57147.391     0.500000         6756         2.00
   61997.055     0.550000         7433         2.22
   66781.183     0.600000         8107         2.50
   71499.775     0.650000         8782         2.86
   76283.903     0.700000         9456         3.33
   81068.031     0.750000        10132         4.00
   83558.399     0.775000        10475         4.44
   85917.695     0.800000        10813         5.00
   88342.527     0.825000        11151         5.71
   90767.359     0.850000        11486         6.67
   93192.191     0.875000        11826         8.00
   94371.839     0.887500        11991         8.89
   95617.023     0.900000        12165        10.00
   96796.671     0.912500        12330        11.43
   97976.319     0.925000        12496        13.33
   99287.039     0.937500        12668        16.00
   99876.863     0.943750        12751        17.78
  100466.687     0.950000        12835        20.00
  101056.511     0.956250        12918        22.86
  101711.871     0.962500        13006        26.67
  102301.695     0.968750        13090        32.00
  102629.375     0.971875        13139        35.56
  102891.519     0.975000        13174        40.00
  103219.199     0.978125        13216        45.71
  103546.879     0.981250        13259        53.33
  103809.023     0.984375        13297        64.00
  104005.631     0.985938        13321        71.11
  104202.239     0.987500        13347        80.00
  104333.311     0.989062        13364        91.43
  104464.383     0.990625        13384       106.67
  104595.455     0.992188        13404       128.00
  104726.527     0.992969        13421       142.22
  104792.063     0.993750        13432       160.00
  104857.599     0.994531        13442       182.86
  104923.135     0.995313        13449       213.33
  104988.671     0.996094        13458       256.00
  105054.207     0.996484        13469       284.44
  105054.207     0.996875        13469       320.00
  105119.743     0.997266        13478       365.71
  105119.743     0.997656        13478       426.67
  105185.279     0.998047        13485       512.00
  105185.279     0.998242        13485       568.89
  105250.815     0.998437        13493       640.00
  105250.815     0.998633        13493       731.43
  105250.815     0.998828        13493       853.33
  105316.351     0.999023        13499      1024.00
  105316.351     0.999121        13499      1137.78
  105316.351     0.999219        13499      1280.00
  105316.351     0.999316        13499      1462.86
  105381.887     0.999414        13502      1706.67
  105381.887     0.999512        13502      2048.00
  105447.423     0.999561        13505      2275.56
  105447.423     0.999609        13505      2560.00
  105447.423     0.999658        13505      2925.71
  105447.423     0.999707        13505      3413.33
  105447.423     0.999756        13505      4096.00
  105512.959     0.999780        13508      4551.11
  105512.959     1.000000        13508          inf
#[Mean    =    57069.191, StdDeviation   =    27813.449]
#[Max     =   105447.424, Total count    =        13508]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14670 requests in 2.00m, 5.22MB read
  Non-2xx or 3xx responses: 14670
Requests/sec:    122.15
Transfer/sec:     44.49KB

Run #2:

Running 2m test @ https://staging-api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 4834.426ms, rate sampling interval: 16941ms
  Thread calibration: mean lat.: 4857.542ms, rate sampling interval: 16318ms
  Thread calibration: mean lat.: 4888.165ms, rate sampling interval: 16318ms
  Thread calibration: mean lat.: 4905.766ms, rate sampling interval: 16908ms
  Thread calibration: mean lat.: 4836.102ms, rate sampling interval: 16875ms
  Thread calibration: mean lat.: 4901.891ms, rate sampling interval: 16908ms
  Thread calibration: mean lat.: 4886.341ms, rate sampling interval: 16293ms
  Thread calibration: mean lat.: 4906.885ms, rate sampling interval: 16924ms
  Thread calibration: mean lat.: 4921.386ms, rate sampling interval: 16285ms
  Thread calibration: mean lat.: 4879.050ms, rate sampling interval: 16334ms
  Thread calibration: mean lat.: 4913.404ms, rate sampling interval: 16908ms
  Thread calibration: mean lat.: 4859.255ms, rate sampling interval: 16293ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96m    27.82s    1.77m    57.68%
    Req/Sec     9.53      0.50    10.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.97m
 75.000%    1.37m
 90.000%    1.61m
 99.000%    1.75m
 99.900%    1.76m
 99.990%    1.77m
 99.999%    1.77m
100.000%    1.77m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9117.695     0.000000            1         1.00
   19398.655     0.100000         1322         1.11
   28868.607     0.200000         2641         1.25
   38567.935     0.300000         3961         1.43
   48398.335     0.400000         5283         1.67
   57933.823     0.500000         6603         2.00
   62750.719     0.550000         7259         2.22
   67436.543     0.600000         7919         2.50
   72417.279     0.650000         8588         2.86
   77266.943     0.700000         9246         3.33
   82051.071     0.750000         9905         4.00
   84410.367     0.775000        10234         4.44
   86769.663     0.800000        10564         5.00
   89260.031     0.825000        10891         5.71
   91750.399     0.850000        11223         6.67
   94109.695     0.875000        11550         8.00
   95289.343     0.887500        11716         8.89
   96468.991     0.900000        11886        10.00
   97648.639     0.912500        12051        11.43
   98828.287     0.925000        12215        13.33
   99942.399     0.937500        12376        16.00
  100532.223     0.943750        12458        17.78
  101122.047     0.950000        12540        20.00
  101777.407     0.956250        12626        22.86
  102367.231     0.962500        12706        26.67
  102957.055     0.968750        12787        32.00
  103284.735     0.971875        12830        35.56
  103612.415     0.975000        12877        40.00
  103874.559     0.978125        12913        45.71
  104202.239     0.981250        12957        53.33
  104464.383     0.984375        12993        64.00
  104660.991     0.985938        13021        71.11
  104792.063     0.987500        13041        80.00
  104923.135     0.989062        13059        91.43
  105054.207     0.990625        13077       106.67
  105185.279     0.992188        13095       128.00
  105250.815     0.992969        13106       142.22
  105381.887     0.993750        13123       160.00
  105447.423     0.994531        13131       182.86
  105512.959     0.995313        13141       213.33
  105578.495     0.996094        13150       256.00
  105644.031     0.996484        13159       284.44
  105644.031     0.996875        13159       320.00
  105709.567     0.997266        13167       365.71
  105775.103     0.997656        13177       426.67
  105775.103     0.998047        13177       512.00
  105775.103     0.998242        13177       568.89
  105840.639     0.998437        13185       640.00
  105840.639     0.998633        13185       731.43
  105840.639     0.998828        13185       853.33
  105906.175     0.999023        13191      1024.00
  105906.175     0.999121        13191      1137.78
  105906.175     0.999219        13191      1280.00
  105906.175     0.999316        13191      1462.86
  105906.175     0.999414        13191      1706.67
  105971.711     0.999512        13193      2048.00
  105971.711     0.999561        13193      2275.56
  105971.711     0.999609        13193      2560.00
  106037.247     0.999658        13196      2925.71
  106037.247     0.999707        13196      3413.33
  106037.247     0.999756        13196      4096.00
  106037.247     0.999780        13196      4551.11
  106037.247     0.999805        13196      5120.00
  106037.247     0.999829        13196      5851.43
  106102.783     0.999854        13198      6826.67
  106102.783     1.000000        13198          inf
#[Mean    =    57880.895, StdDeviation   =    27815.026]
#[Max     =   106037.248, Total count    =        13198]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14113 requests in 2.00m, 5.02MB read
  Non-2xx or 3xx responses: 14113
Requests/sec:    117.53
Transfer/sec:     42.81KB

Run #3:

Running 2m test @ https://staging-api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 4573.378ms, rate sampling interval: 15990ms
  Thread calibration: mean lat.: 4607.715ms, rate sampling interval: 15982ms
  Thread calibration: mean lat.: 4627.189ms, rate sampling interval: 16056ms
  Thread calibration: mean lat.: 4580.170ms, rate sampling interval: 15998ms
  Thread calibration: mean lat.: 4634.696ms, rate sampling interval: 15998ms
  Thread calibration: mean lat.: 4626.604ms, rate sampling interval: 15925ms
  Thread calibration: mean lat.: 4571.080ms, rate sampling interval: 15974ms
  Thread calibration: mean lat.: 4573.410ms, rate sampling interval: 15933ms
  Thread calibration: mean lat.: 4559.667ms, rate sampling interval: 16130ms
  Thread calibration: mean lat.: 4602.453ms, rate sampling interval: 15958ms
  Thread calibration: mean lat.: 4588.800ms, rate sampling interval: 15974ms
  Thread calibration: mean lat.: 4563.622ms, rate sampling interval: 15826ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95m    27.66s    1.77m    57.68%
    Req/Sec     9.35      0.48    10.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95m
 75.000%    1.35m
 90.000%    1.58m
 99.000%    1.74m
 99.900%    1.76m
 99.990%    1.77m
 99.999%    1.77m
100.000%    1.77m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8855.551     0.000000            1         1.00
   18382.847     0.100000         1295         1.11
   28016.639     0.200000         2590         1.25
   37584.895     0.300000         3888         1.43
   47284.223     0.400000         5180         1.67
   56819.711     0.500000         6477         2.00
   61669.375     0.550000         7122         2.22
   66551.807     0.600000         7773         2.50
   71237.631     0.650000         8417         2.86
   75956.223     0.700000         9063         3.33
   80805.887     0.750000         9719         4.00
   83230.719     0.775000        10038         4.44
   85590.015     0.800000        10358         5.00
   87949.311     0.825000        10686         5.71
   90243.071     0.850000        11012         6.67
   92602.367     0.875000        11331         8.00
   93782.015     0.887500        11493         8.89
   94961.663     0.900000        11653        10.00
   96206.847     0.912500        11823        11.43
   97386.495     0.925000        11984        13.33
   98631.679     0.937500        12146        16.00
   99155.967     0.943750        12220        17.78
   99745.791     0.950000        12303        20.00
  100335.615     0.956250        12385        22.86
  100925.439     0.962500        12466        26.67
  101515.263     0.968750        12547        32.00
  101777.407     0.971875        12586        35.56
  102105.087     0.975000        12630        40.00
  102367.231     0.978125        12668        45.71
  102694.911     0.981250        12710        53.33
  103284.735     0.984375        12748        64.00
  103546.879     0.985938        12766        71.11
  103809.023     0.987500        12790        80.00
  104136.703     0.989062        12810        91.43
  104333.311     0.990625        12827       106.67
  104660.991     0.992188        12849       128.00
  104792.063     0.992969        12863       142.22
  104857.599     0.993750        12867       160.00
  105054.207     0.994531        12880       182.86
  105119.743     0.995313        12888       213.33
  105250.815     0.996094        12900       256.00
  105316.351     0.996484        12905       284.44
  105381.887     0.996875        12909       320.00
  105447.423     0.997266        12912       365.71
  105578.495     0.997656        12921       426.67
  105644.031     0.998047        12926       512.00
  105644.031     0.998242        12926       568.89
  105709.567     0.998437        12934       640.00
  105709.567     0.998633        12934       731.43
  105709.567     0.998828        12934       853.33
  105775.103     0.999023        12937      1024.00
  105775.103     0.999121        12937      1137.78
  105775.103     0.999219        12937      1280.00
  105840.639     0.999316        12942      1462.86
  105840.639     0.999414        12942      1706.67
  105840.639     0.999512        12942      2048.00
  105840.639     0.999561        12942      2275.56
  105840.639     0.999609        12942      2560.00
  105906.175     0.999658        12945      2925.71
  105906.175     0.999707        12945      3413.33
  105906.175     0.999756        12945      4096.00
  105906.175     0.999780        12945      4551.11
  105906.175     0.999805        12945      5120.00
  105906.175     0.999829        12945      5851.43
  105971.711     0.999854        12946      6826.67
  105971.711     0.999878        12946      8192.00
  105971.711     0.999890        12946      9102.22
  105971.711     0.999902        12946     10240.00
  105971.711     0.999915        12946     11702.86
  106102.783     0.999927        12947     13653.33
  106102.783     1.000000        12947          inf
#[Mean    =    56786.110, StdDeviation   =    27663.801]
#[Max     =   106037.248, Total count    =        12947]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14098 requests in 2.00m, 5.01MB read
  Non-2xx or 3xx responses: 14098
Requests/sec:    117.32
Transfer/sec:     42.74KB